Revit 2027 API
Form.ConstrainProfiles Method
Constrain form profiles using the specified profile as primary. This is an advanced version of property "AreProfilesConstrained", allowing specify the primary profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ConstrainProfiles(
	int primaryProfileIndex
)
Public Sub ConstrainProfiles (
	primaryProfileIndex As Integer
)
public:
void ConstrainProfiles(
	int primaryProfileIndex
)
member ConstrainProfiles :
        primaryProfileIndex : int -> unit
Parameters
primaryProfileIndex Int32
Index to specify the profile used as primary profile.
Exceptions
Exception | Condition
InvalidOperationException |  This operation can only be performed on a swept blend form.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace